//זהו המנוע של התוכנית, שקורא את קובץ הטקסט, יוצר את המשתמשים ומדפיס את התוצאות

package com.example; 
// הגדרת החבילה בה נמצא הקובץ ,כדי שהקוד יתקמפל בכלי של מייבן
import java.io.File; 
// ייבוא מחלקה מובנית של ג'אווה, המאפשרת טיפול וקריאה של קבצים
import java.util.ArrayList; 
// ייבוא מחלקה, ליצירת מערך דינמי של משתמשים
import java.util.Collections; 
// ייבוא מחלקה, שתספק לנו את פונקציית המיון
import java.util.Scanner; 
// ייבוא מחלקה שתשמש לקריאת הטקסט, מתוך הקובץ, שורה אחר שורה

public class UsersApp 
// הגדרת המחלקה הראשית, שמכילה את התוכנית הראשית
{ 
    public static void main(String[] args) 
// מתודת התוכנית הראשית, מנקודה זו, המחשב מתחיל להריץ את הקוד בפועל    
    {   
        ArrayList<User> validUsers = new ArrayList<>(); 
// יצירת מערך דינאמי וריק מסוג יוזר, שישמור בתוכו רק את המשתמשים התקינים
        
        File file = new File("users.txt"); 
// הגדרת אובייקט מסוג קובץ, המצביע אל קובץ הטקסט 

        try (Scanner scanner = new Scanner(file)) 
// הגדרת אובייקט מסוג מחלקת סורק ,לקריאת הקובץ, שמבטיח את סגירתו האוטומטית בסיום        
        { 
            while (scanner.hasNextLine()) 
 // לולאה שתרוץ, כל עוד יש שורה נוספת לקרוא, מתוך קובץ הטקסט               
                { 
                String line = scanner.nextLine(); 
// קריאת השורה הנוכחית, ושמירתה בתוך משתנה מחרוזת 
                
                if (line.trim().isEmpty()) 
//בדיקה שמוודאת שהשורה אינה ריקה (מונעת קריסה במידה ויש שורות ריקות בסוף הקובץ)                    
                { 
                 continue; 
// אם השורה ריקה, מדלג עליה וממשיך מיד לריצת הלולאה הבאה
                } 
                
                String[] parts = line.split("\\s+"); 
// פיצול השורה למערך מילים, כאשר ההפרדה נעשית לפי רווח אחד או יותר
                
                if (parts.length >= 2) 
// תנאי המוודא, שיש בשורה לפחות שני חלקים (שם משתמש וסיסמה) כדי למנוע קריסה                
                {                     
                    try 
// פתיחת בלוק ניסיון, כדי לנסות ליצור משתמש חדש, בידיעה שייתכן ותיזרק שגיאה מהבנאי                    
                    { 
                        User user = new User(parts[0], parts[1]); 
// ניסיון ליצור מופע חדש של יוזר, עם האיבר הראשון והשני מהשורה
                        validUsers.add(user); 
// אם יצירת המשתמש הצליחה (ולא נזרקה שגיאה), המשתמש מתווסף לרשימת המשתמשים התקינים
                        
                    } 
                    catch (Exception e) 
// תפיסת השגיאה, במידה והבנאי זרק אותה (משתמש לא תקין)                    
                    { 
                        System.err.println(line + " " + e.getMessage()); 
// הדפסת השורה השגויה מהקובץ, ואחריה את הודעת השגיאה המתאימה שנתפסה
                    } 
                    
                } 
// סגירת התנאי שבודק את אורך המערך
            } 
// סגירת לולאת הסריקה של הקובץ
            
        } 
        catch (Exception e) 
// תפיסת שגיאות הקשורות לטעינת הקובץ (למשל, במקרה שקובץ הטקסט אינו קיים בתיקייה)        
        { 
            System.out.println("Error reading file: " + e.getMessage()); 
// הדפסת הודעת שגיאה כללית למסך במקרה של תקלה בקריאת הקובץ.
        } 

        Collections.sort(  validUsers ,   (u1, u2) -> u1.getUsername().compareTo(u2.getUsername())   ); 
// מיון הרשימה באמצעות פונקציית למבדה, שמשווה אלפביתית בין שמות המשתמשים של כל צמד אובייקטים ברשימה      
// הקלט השמאלי זה המערך שיצרנו קודם, אותו אנו רוצים למיין

        for (User u : validUsers) 
// לולאה שעוברת על כל אחד מאובייקטי היוזר, בתוך הרשימה הממוינת
        { 
            System.out.println(u.toString()); 
// הדפסת נתוני המשתמש למסך
        } 
       
    } 

} 